In [1]:
import pandas as pd
df = pd.read_csv('data/survey_results_public.csv', index_col='Respondent')
schema_df = pd.read_csv('data/survey_results_schema.csv', index_col='Column')

dict_data = {
    'first': ['kaushal', 'pinkal', 'ananya', 'kartavya'],
    'last': ['khokhar', 'khokhar', 'patel', 'patel'],
    'email':['kaushal.123@gmail.com', 'pinal.123@gmail.com', 'anu.123@gmail.com', 'kartu.123@gmail.com']
}

dict_to_df = pd.DataFrame(dict_data)

In [2]:
# Adding Columns
dict_to_df['fullname'] = dict_to_df['first'] + ' ' + dict_to_df['last']

In [3]:
dict_to_df

      first     last                  email         fullname
0   kaushal  khokhar  kaushal.123@gmail.com  kaushal khokhar
1    pinkal  khokhar    pinal.123@gmail.com   pinkal khokhar
2    ananya    patel      anu.123@gmail.com     ananya patel
3  kartavya    patel    kartu.123@gmail.com   kartavya patel

In [4]:
# Removing Columns
dict_to_df.drop(columns=['first', 'last'], inplace=True)

In [5]:
dict_to_df

                   email         fullname
0  kaushal.123@gmail.com  kaushal khokhar
1    pinal.123@gmail.com   pinkal khokhar
2      anu.123@gmail.com     ananya patel
3    kartu.123@gmail.com   kartavya patel

In [6]:
dict_to_df['fullname'].str.split(' ', expand=True)

          0        1
0   kaushal  khokhar
1    pinkal  khokhar
2    ananya    patel
3  kartavya    patel

In [7]:
dict_to_df[['first', 'last']] = dict_to_df['fullname'].str.split(' ', expand=True)

In [8]:
dict_to_df

                   email         fullname     first     last
0  kaushal.123@gmail.com  kaushal khokhar   kaushal  khokhar
1    pinal.123@gmail.com   pinkal khokhar    pinkal  khokhar
2      anu.123@gmail.com     ananya patel    ananya    patel
3    kartu.123@gmail.com   kartavya patel  kartavya    patel

In [9]:
# Adding/Removing Rows
dict_to_df.append({'first': 'pzpatel'}, ignore_index=True)

                   email         fullname     first     last
0  kaushal.123@gmail.com  kaushal khokhar   kaushal  khokhar
1    pinal.123@gmail.com   pinkal khokhar    pinkal  khokhar
2      anu.123@gmail.com     ananya patel    ananya    patel
3    kartu.123@gmail.com   kartavya patel  kartavya    patel
4                    NaN              NaN   pzpatel      NaN

In [10]:
new_data = {
    'first': ['jppatel', 'pzpatel'],
    'last': ['khokhar', 'patel'],
    'email':['jppatel;.123@gmail.com', 'pzpatel.123@gmail.com']
}

new_to_df = pd.DataFrame(new_data)

In [11]:
new_to_df

     first     last                   email
0  jppatel  khokhar  jppatel;.123@gmail.com
1  pzpatel    patel   pzpatel.123@gmail.com

In [12]:
dict_to_df = dict_to_df.append(new_to_df, ignore_index=True)
dict_to_df

                    email         fullname     first     last
0   kaushal.123@gmail.com  kaushal khokhar   kaushal  khokhar
1     pinal.123@gmail.com   pinkal khokhar    pinkal  khokhar
2       anu.123@gmail.com     ananya patel    ananya    patel
3     kartu.123@gmail.com   kartavya patel  kartavya    patel
4  jppatel;.123@gmail.com              NaN   jppatel  khokhar
5   pzpatel.123@gmail.com              NaN   pzpatel    patel

In [15]:
dict_to_df.drop(index=5, inplace=True)

In [17]:
dict_to_df

                    email         fullname     first     last
0   kaushal.123@gmail.com  kaushal khokhar   kaushal  khokhar
1     pinal.123@gmail.com   pinkal khokhar    pinkal  khokhar
2       anu.123@gmail.com     ananya patel    ananya    patel
3     kartu.123@gmail.com   kartavya patel  kartavya    patel
4  jppatel;.123@gmail.com              NaN   jppatel  khokhar

In [19]:
filtr = dict_to_df['last'] == 'patel'

In [21]:
dict_to_df.drop(index=dict_to_df[filtr].index)

                    email         fullname    first     last
0   kaushal.123@gmail.com  kaushal khokhar  kaushal  khokhar
1     pinal.123@gmail.com   pinkal khokhar   pinkal  khokhar
4  jppatel;.123@gmail.com              NaN  jppatel  khokhar